
Функция ПолучитьЧисло(строка)
	
	// Все спереди буквы и нули режет
	
	Длина = СтрДлина(строка);
	Для Ном = 1 По Длина Цикл
		Если СтрНайти("123456789", Сред(Строка, Ном, 1)) Тогда
			Прервать; КонецЕсли; КонецЦикла;
	
	Возврат Сред(строка, Ном);
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("#%1 %2", ПолучитьЧисло(Данные.Номер), Данные.Наименование);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля = СтрРазделить("Наименование,Номер", ",");
	
КонецПроцедуры
