
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанных = Тип("Структура") Тогда
		КонвертацияТипов.ЗаполнитьОбъектПоСтруктуреОснованию(ЭтотОбъект, ДанныеЗаполнения); КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Элемент Из ДополнительныеСвойства.ДоЗаписи Цикл
		Если ЭтотОбъект[Элемент.Ключ] <> Элемент.Значение Тогда
			
			Если Элемент.Ключ = "Описание" Тогда
				Запись = РегистрыСведений.ИсторияОписанийЗадач.СоздатьМенеджерЗаписи();
			Иначе
				Запись = РегистрыСведений.ИсторияРеквизитовЗадач.СоздатьМенеджерЗаписи();
				Запись.ИмяРеквизита = Элемент.Ключ; КонецЕсли; 
			
			Запись.Значение = ЭтотОбъект[Элемент.Ключ];
			Запись.Период	= Дата;
			Запись.Задача 	= Ссылка;
			Запись.Автор 	= Ответственный;
			
			Если Не ОбщиеФункции.ЗаписатьИСообщитьЕслиОшибка(Запись) Тогда
				Отказ = Истина;
				Возврат; КонецЕсли; КонецЕсли; КонецЦикла;
	
	Движения.ЗатраченноеВремя.Очистить();
	Запись = Движения.ЗатраченноеВремя.Добавить();
	Запись.Период 		= Дата;
	Запись.Проект 		= Проект;
	Запись.Пользователь = Ответственный;
	Запись.Задача 		= Ссылка;
	Запись.Секунд 		= Факт;
	Запись.Сумма 		= Сумма;
	
	Движения.ЗатраченноеВремя.Записать();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = Проект.Префикс;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Структура = новый Структура;
	Для Каждого Ревизит Из Метаданные().Реквизиты Цикл Структура.Вставить(Ревизит.Имя, Ссылка[Ревизит.Имя]) КонецЦикла;
			
	ДополнительныеСвойства.Вставить("ДоЗаписи" , Структура);
	
КонецПроцедуры
