
Функция ПолучитьЗапросаСДатами(ТекстЗапроса, Сотрудник, Проект, ДатаНачала, ДатаОкончания)
	
	// Формирует запрос устанавливает параметры
	
	Запрос = Новый Запрос(СтрЗаменить(ТекстЗапроса, 
		"//+ГДЕ", СтрШаблон("%1 %2 %3", 
		?(ЗначениеЗаполнено(Проект),"			И Задача.Проект = &Проект", ""),
		?(ЗначениеЗаполнено(ДатаНачала),"		И Период >= &ДатаНачала", ""),
		?(ЗначениеЗаполнено(ДатаОкончания),"	И Период <= &ДатаОкончания", ""))));
	
	Запрос.УстановитьПараметр("Сотрудник", 		Сотрудник);
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ДатаОкончания);
	
	Возврат Запрос;
	
КонецФункции

Функция ПолучитьИзмененийРеквизитовЗадачСотруднника(Сотрудник, Проект = Неопределено, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
	
	// Возвращает хронологическую таблицу по изменении реквизитов задач
	//	Задача
	//	Период
	//	Реквизит 				- реквизит над которым производилось действие
	//	Значение				- значение которе было установлено
	
	Возврат ПолучитьЗапросаСДатами("
	|ВЫБРАТЬ 	Задача, Период, ИмяРеквизита Реквизит, Значение
	|ИЗ			РегистрСведений.ИсторияРеквизитовЗадач
	|ГДЕ		Автор = &Сотрудник И ИмяРеквизита <> ""ФактДоп"" //+ГДЕ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 	Задача, Период, ""Описание"", Значение
	|ИЗ			РегистрСведений.ИсторияРеквизитовЗадач
	|ГДЕ		Автор = &Сотрудник //+ГДЕ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 	Задача, Период, ""Комментарий"", ВЫРАЗИТЬ(Комментарий КАК СТРОКА(1000))
	|ИЗ			РегистрСведений.КомментарииЗадач
	|ГДЕ		Автор = &Сотрудник //+ГДЕ
	|
	|УПОРЯДОЧИТЬ ПО Период
	|", Сотрудник, Проект, ДатаНачала, ДатаОкончания).Выполнить().Выгрузить();
	
КонецФункции
Функция ПолучитьТаблицуВремениСотруднника(Сотрудник, Проект = Неопределено, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
	
	// Возвращает когда таймер был включен а когда отключен
	//	Задача
	//	ДатаНачала		- таймер он
	//	ДатаОкончания	- таймер офф
	
	Возврат ПолучитьЗапросаСДатами("
	
	|ВЫБРАТЬ 	Задача, ДОБАВИТЬКДАТЕ(Период, СЕКУНДА, -ВЫРАЗИТЬ(Значение КАК ЧИСЛО)) ДатаНачала, Период ДатаОкончания
	|ИЗ			РегистрСведений.ИсторияРеквизитовЗадач
	|ГДЕ		Автор = &Сотрудник И ИмяРеквизита = ""Факт"" //+ГДЕ
	|
	|УПОРЯДОЧИТЬ ПО ДатаНачала
	|
	|", Сотрудник, Проект, ДатаНачала, ДатаОкончания).Выполнить().Выгрузить();
	
КонецФункции