
&НаКлиенте
Процедура ОткрытьПредвРасчетНажатие(Элемент)
	
	ОткрытьФорму("Отчет.ПредварительнаяСтоимостьЗадач.ФормаОбъекта", Новый Структура("СформироватьПриОткрытии", Истина));
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьОтчетОплатНажатие(Элемент)
	
	ОткрытьФорму("Отчет.ОплатыЗадач.ФормаОбъекта", Новый Структура("СформироватьПриОткрытии", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьПарольНажатие(Элемент)
	
	ОткрытьФорму("Справочник.Пользователи.Форма.ВводПароля", Новый Структура("ПоказатьНадпись1", Истина),,,,,Новый ОписаниеОповещения("ПолучитьНовыйПарольПользователя", МодульКлиента, Истина)); 
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЗадачиНажатие(Элемент)
	
	ОткрытьФорму("Документ.Задача.ФормаСписка");
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьСчетаНажатие(Элемент)
	
	ОткрытьФорму("Документ.СчетНаОплату.ФормаСписка");
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьОплатыНажатие(Элемент)
	
	ОткрытьФорму("Документ.Оплата.ФормаСписка");
	
КонецПроцедуры



