
&НаСервере
Функция ПолучитьСтрокуJSONНаСервере(ИмяФункции, Запрос = Неопределено)

	//Если Запрос = Неопределено Тогда Запрос = Новый Структура КонецЕсли;
	
	ответHTTP = Вычислить("unityApi." + ИмяФункции + "(Запрос)");
	Строка = Строка(ответHTTP.ПолучитьТелоКакСтроку());
	
	Возврат Строка;

КонецФункции

&НаКлиенте
Процедура ПолучитьСтрокуJSON(Команда)
	
	ТекстовыйДок = новый ТекстовыйДокумент;
	ТекстовыйДок.УстановитьТекст(ПолучитьСтрокуJSONНаСервере(Команда.Имя));
	ТекстовыйДок.Показать();
	
КонецПроцедуры
