&НаСервере
Процедура ОбновитьСотрудника()
	
	ОбновитьКалендарь();
	ОбновитьГанта();
	ОбновитьГантаВЕБ();

КонецПроцедуры

&НаСервере
Процедура ОбновитьГантаВЕБ()
	
	ГантВеб = ПолучитьОбщийМакет("Диаграмаганта").ПолучитьТекст();
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьКалендарь()
	
	Таблица = УчетВремени.ПолучитьИзмененийРеквизитовЗадачСотруднника(Сотрудник, Проект);
	
	Для Каждого Строка Из Таблица Цикл
		
		Элемент = Календарь.Элементы.Добавить(Строка.Период, Строка.Период);
		Элемент.Текст = Строка(Строка.Задача) + " изменил " + Строка.Реквизит;
		Элемент.Подсказка = Строка(Строка.Значение);
		
	КонецЦикла;
	
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьГанта();
	
	Таблица = УчетВремени.ПолучитьТаблицуВремениСотруднника(Сотрудник, Проект);
	
	Гант.Очистить();
	
	СерияФакт = Гант.Серии.Добавить();
	СерияФакт.Текст = "Факт";
	
	СерияПлан = Гант.Серии.Добавить();
	СерияПлан.Текст = "План";
	
	отрЗадачи = Новый Соответствие;
	
	Для Каждого Строка Из Таблица Цикл
		Если отрЗадачи[Строка.Задача] = Неопределено Тогда
			отрЗадачи.Вставить(Строка.Задача, Истина);
		
			Точка = Гант.Точки.Добавить();
			Точка.Текст = Строка.Задача;
			
			Если Строка.Задача.План Тогда
				Интервал = Гант.ПолучитьЗначение(Точка, СерияПлан).Добавить();
				Интервал.Начало = Строка.Задача.ДатаСоздания;
				Интервал.Конец 	= Строка.Задача.ДатаСоздания + Строка.Задача.План * 3600; КонецЕсли;
			
			Значение = Гант.ПолучитьЗначение(Точка, СерияФакт);
			
			Строки = Таблица.найтиСтроки(Новый Структура("Задача", Строка.Задача));
			Для Каждого СтрокаИнтрвала Из Строки Цикл
			
				Интервал = Значение.Добавить();
				Интервал.Начало = СтрокаИнтрвала.ДатаНачала;
				Интервал.Конец 	= СтрокаИнтрвала.ДатаОкончания; КонецЦикла; КонецЕсли; КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ОбновитьСотрудника();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ОбновитьСотрудника();
	
КонецПроцедуры
