
Функция ЗаписатьИСообщитьЕслиОшибка(Объект, ДопПараметры = Неопределено) Экспорт
	
	// Записывает и сообщает если ошибка
	
	Попытка		Если ДопПараметры <> Неопределено Тогда
						Объект.Записать(ДопПараметры);
				Иначе	Объект.Записать(); КонецЕсли;
	Исключение
		Сообщить("Ошибка записи объекта " + Объект);
		Возврат Ложь; КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаписатьИзмененияОбъекта(Объект, Поля, ДопПараметры = Неопределено, ПоляИсключения = Неопределено) Экспорт
	
	// Функция записывает объект емли переданные поля отличаются
	// Объект 			- объект, Важно! что сравнение будет через Объект.Ссылка
	// Поля 			- структура (ключ,значение)
	// ПоляИсключения 	- строка, перечень полей через запятую которые не нужно проверять
	//
	// Возвращает ЛОЖЬ если произошла ошибка записи объекта, в остальных случаях всегда ИСТИНА
	
	массИсключений = ?(ПоляИсключения = Неопределено, Новый Массив, КонвертацияТипов.ПолучитьМассивИзСтроки(НРег(ПоляИсключения)));
	
	Изменился = Ложь;
	Для Каждого Поле Из Поля Цикл
		Если массИсключений.Найти(НРег(Поле.Ключ)) = Неопределено И объект.Ссылка[Поле.Ключ] <> Поле.Значение Тогда
			Изменился = Истина;
			объект[Поле.Ключ] = Поле.Значение; КонецЕсли; КонецЦикла;
	
	Возврат Не Изменился Или ЗаписатьИСообщитьЕслиОшибка(Объект, ДопПараметры);
	
КонецФункции